using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Interface_demo
{
    // Інтерфейс - це контракт, який визначає набір методів, які клас повинен реалізувати, якщо він реалізує цей інтерфейс.
    // Інтерфейси не можуть містити реалізацію методів (до C# 8.0), але можуть містити сигнатури методів, властивості, події та індексатори.
    internal interface IFly : IMove // інтерфейс IFly успадковує інтерфейс IMove,
                                    // що означає, що будь-який клас, який реалізує IFly, повинен також реалізувати всі методи, визначені в IMove

    {
        // методи інтерфейсу неявно є абстрактними та відкритими
        int Height { get; set; } // неявно абстрактна властивість, яка має бути реалізована у похідних типах( класах, структурах)
        void Fly(); // метод, який має бути реалізований у класах, які реалізують цей інтерфейс
    }
}
